<a href='https://www.k2analytics.co.in'> <img src='https://k2analytics.co.in/wp-content/uploads/2020/03/Divi-K2-Logo.png' /></a>

<p style="text-align: center; font-size: 12px"> Trainer: Rajesh Jakhotia  </p>
<p style="text-align: center; font-size: 12px"> rajesh@k2analytics.co.in | 8939694874  </p>

***
# PANDAS
***
<font color = #318CE7 size = 3 >

- Pandas is an open source python library that is built on top of NumPy.
- It provides an efficient implementation of a DataFrame.

<font>

***

###  - **` Pandas Data Structures `**

<font color = #318CE7 size = 3 >
    
> `Series`

- A Series is a one-dimensional labeled array which is very similar to a NumPy array.
- What differentiates Series from NumPy arrays is that series can have an access labels with which it can be indexed.

***

<img src="images/pandas_series.png" title="Series" width = 500 height = 500>

Image Reference: https://www.geeksforgeeks.org/python-pandas-series/
***

</font>

***

In [1]:
import pandas as pd

In [2]:
list1 = [5, 6, 7, 8, 9, 10]
my_series = pd.Series(list1)
my_series[0] # index is leftward and values are to the right.

5

In [3]:
# compare 1d-array with above series
import numpy as np
my_list = [5, 6, 7, 8, 9, 10]
array1d = np.array(my_list)
print(array1d)

[ 5  6  7  8  9 10]

In [4]:
#obj_series = pd.Series((1,2,3,4), dtype = int)
t = ["a","b","c","d"]
obj_series = pd.Series(t)
obj_series

0    a
1    b
2    c
3    d
dtype: object

In [5]:
obj_series.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj_series[3] # retrieve elements by their index number

'd'

In [7]:
# You can provide index (labels) explicitly
my_series1 = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'e', 'f'])
my_series1

a     5
b     6
c     7
d     8
e     9
f    10
dtype: int64

In [8]:
my_series1[ ['a' , 'c', 'e'] ]  ## Outer rectangular bracket is to take row index label names as input
## inner rectangular bracket is used when you have to pass more than one label names / index numbers

a    5
c    7
e    9
dtype: int64

### To access a value by position we have to use the iloc method as shown below

In [9]:
my_series1.iloc[  [0 , 2, 4] ]

a    5
c    7
e    9
dtype: int64

In [10]:
my_series1.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [11]:
print("my_series1[4] = ", my_series1.iloc[4])  ## accessing the values based on row position
print("my_series1[e] = ", my_series1['e'])   ## accessing the values based on row index labels

my_series1[4] =  9
my_series1[e] =  9

In [12]:
my_series1.ndim

1

***
<font color = #318CE7 size = 3 >
    
 > Series is very similar to dictionary, where `key` is an index and `value` is an element.
 
</font>

***

In [13]:
#Series from a dictionary
my_series2 = pd.Series(   {'a': 5, 'b': 6, 'c': 7, 'd': 8}   )
my_series2

a    5
b    6
c    7
d    8
dtype: int64

In [14]:
my_series2[0:2]  ## index in python starts from;

## start : end ....the end index is excluded

a    5
b    6
dtype: int64

In [15]:
#Series from a list
list1 = [    [1,2,3] ,   ['a','b']     ]
series_from_list = pd.Series(data = list1)
series_from_list

0    [1, 2, 3]
1       [a, b]
dtype: object

***

### Dataframe
<font color = #318CE7 size = 3 >
    
- Simply said, DataFrame is a table loaded in memory.
- Data Frame is what we call `Table` in SQL parlance, `Dataset` in SAS and `Dataframe` in R terminology
- The basic syntax for creating a DataFrame  : `pd.DataFrame(data,index)`

</font>

***

In [16]:
import pandas as pd
sr_no = [1,2,3] #list
name = ["NM", "AK", "RG"] #list
age = [66, 48, 46] #list
col_names = ["sr_no", "name", "age"] #list

pm = pd.DataFrame(data = [sr_no, name, age] , 
                  index=col_names
                 ).T # Transpose
pm

  sr_no name age
0     1   NM  66
1     2   AK  48
2     3   RG  46

In [17]:
type(pm)

pandas.core.frame.DataFrame

###  - **` Referring Cells, Rows & Columns of Data Frame `**

In [18]:
# df.iloc[ row position, column position]

pm.iloc[ :, [0, 2]]

  sr_no age
0     1  66
1     2  48
2     3  46

In [19]:
# df["column_name"]
pm [["sr_no", "age"]]  ## df["col name"]  or df[   [ "c1", "c3"  ] ]

  sr_no age
0     1  66
1     2  48
2     3  46

In [20]:
## This will return the first column

pm.iloc[ :  ,   0] # get 0th col

0    1
1    2
2    3
Name: sr_no, dtype: object

In [21]:
## This will return the cell at intersection of 1st row (index = 0 ) and 2nd column (index = 1)

pm.iloc[0,1]

'NM'

In [22]:
## This will return the first row

pm.iloc[ 0 ]

sr_no     1
name     NM
age      66
Name: 0, dtype: object

###  - **` Referring column by Column Name, i.e. labels `**

In [23]:
## Referring only one column

pm['name']

0    NM
1    AK
2    RG
Name: name, dtype: object

In [24]:
## Referring multiple columns

pm[   ['sr_no', 'age']   ]

  sr_no age
0     1  66
1     2  48
2     3  46

Label based referencing

Note: for rows the running serial number from 0 to n becomes the index position as well as the label unless you specifically provide the row index names.

In [25]:
pm

  sr_no name age
0     1   NM  66
1     2   AK  48
2     3   RG  46

In [26]:
## Referring specific row and multiple columns

pm.loc[   0:2   ,    ['sr_no', 'age']   ] #Labels

  sr_no age
0     1  66
1     2  48
2     3  46

In [27]:
pm.iloc[   :    ,    [0, 2]   ] # Index Numbers

  sr_no age
0     1  66
1     2  48
2     3  46

In [28]:
pm['name']

0    NM
1    AK
2    RG
Name: name, dtype: object

In [29]:
pm.loc[: , 'name']

0    NM
1    AK
2    RG
Name: name, dtype: object

### The below code will give invalid syntax error.

In [30]:
#pm.loc [ row position, column position]
pm.loc[  , 'age']

SyntaxError: invalid syntax (3868006899.py, line 2)

### The correct syntax will be

In [31]:
pm.loc[: , 'age']

0    66
1    48
2    46
Name: age, dtype: object

In [32]:
pm[ 'age' ]

0    66
1    48
2    46
Name: age, dtype: object

In [33]:
pm.age

0    66
1    48
2    46
Name: age, dtype: object

###  - **` Some basic dataframe attributes like dimensions, shape, and size `**

In [34]:
pm.ndim

2

In [35]:
pm.shape

(3, 3)

In [36]:
pm.size

9

###  - **` Adding Column or Row to an existing data frame `**

- `Adding Column`

Note python does not allow columns to be creatred via a new attribute name, the below code will create attribute by the name "pm.New_Column" instead of creating a column "New_Column" in the "pm" dataframe

### Wrong Syntax to create a column is given below
### The syntax will create an attribute, not a column in the DataFrame

In [37]:
pm.age_in_mths = pm.age * 12  # this is wrong syntax to create new column

C:\Users\rjakh\AppData\Local\Temp\ipykernel_33992\3660277328.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  pm.age_in_mths = pm.age * 12  # this is wrong syntax to create new column

In [38]:
pm

  sr_no name age
0     1   NM  66
1     2   AK  48
2     3   RG  46

In [39]:
pm.age_in_mths

0    792
1    576
2    552
Name: age, dtype: object

### Correct syntax to create a column

In [40]:
pm["age_in_mths_2"] = pm.age * 12 # this is right approach to create new column

In [41]:
pm

  sr_no name age age_in_mths_2
0     1   NM  66           792
1     2   AK  48           576
2     3   RG  46           552

### Do not create an attribute having same name as column name

In [42]:
pm["sr_no"]

0    1
1    2
2    3
Name: sr_no, dtype: object

In [43]:
pm.sr_no = "This is Serial Number"

In [44]:
pm.sr_no

0    This is Serial Number
1    This is Serial Number
2    This is Serial Number
Name: sr_no, dtype: object

In [45]:
pm

                   sr_no name age age_in_mths_2
0  This is Serial Number   NM  66           792
1  This is Serial Number   AK  48           576
2  This is Serial Number   RG  46           552

### To define an attribute for column metadata, enclose the attribute name with underscores (_) as both a prefix and suffix.

In [46]:
pm._name_ = "The names are abbreviated Initials of Fname and Lname"

In [47]:
pm._name_

'The names are abbreviated Initials of Fname and Lname'

In [48]:
pm

                   sr_no name age age_in_mths_2
0  This is Serial Number   NM  66           792
1  This is Serial Number   AK  48           576
2  This is Serial Number   RG  46           552

### getattr() and delattr()

In [49]:
getattr(pm, "age_in_mths")

0    792
1    576
2    552
Name: age, dtype: object

In [50]:
delattr(pm, "age_in_mths")

###  - **` Dropping Row / Column `**

In [51]:
pm

                   sr_no name age age_in_mths_2
0  This is Serial Number   NM  66           792
1  This is Serial Number   AK  48           576
2  This is Serial Number   RG  46           552

In [52]:
pm = pm.drop([2], axis = 0) ## axis = 0 means row number
pm

                   sr_no name age age_in_mths_2
0  This is Serial Number   NM  66           792
1  This is Serial Number   AK  48           576

In [53]:
pm = pm.drop(["sr_no"], axis = 1) ## axis = 1 means column
pm

  name age age_in_mths_2
0   NM  66           792
1   AK  48           576

<font color = Cadmium orange> REMEMBER </font>
***
<font color = #318CE7 size = 3 >

- `loc` gets rows (or columns) with particular labels from the index. 
- `iloc` gets rows (or columns) at particular positions in the index (so it only takes integers).

<font>

___
<a href='https://www.k2analytics.co.in'> <img src='K2_Logo.jpg' alt="https://k2analytics.co.in" style="width:300px" /></a>